{
    "meetingDate": "2024-07-18",
    "meetingType": "STLLUG",
    "presentations": [
        {
            "title": "Architectures Big and Small",
            "presenterNames": ["Craig Buchek"],
            "abstract": "A look at how software patterns came from patterns in building architectures, and what we can learn.",
            "references": [
                {
                    "url": "https://www.freecodecamp.org/news/an-introduction-to-software-architecture-patterns/",
                    "linkText": "The Software Architecture Handbook (freecodecamp.org)"
                },
                {
                    "url": "https://herbertograca.com/2017/11/16/explicit-architecture-01-ddd-hexagonal-onion-clean-cqrs-how-i-put-it-all-together/",
                    "linkText": "DDD, Hexagonal, Onion, Clean, CQRS, … How I put it all together (herbertograca.com)"
                }
            ],
            "tags": ["programming", "software-architecture"],
            "tweet": "🖥️✨ Join us on 2024-07-18 for 'Architectures Big and Small' by Craig Buchek! Explore the fascinating origins of software patterns inspired by building architectures. #Software #Architecture #SLUUG https://www.meetup.com/saint-louis-unix-users-group/events/301573177/"
        }
    ],
    "meetupUrl": "https://www.meetup.com/saint-louis-unix-users-group/events/301573177/",
    "youtubeTitle": "STLLUG 2024-07-18 - What Software Can Learn from Building Architectures: Patterns Explored",
    "image": {
        "src": "./2024-07-18_stllug_create-an-image-where-a-city-skyline-featuring-a-blend-of-cl.png",
        "alt": "Create an image where a city skyline featuring a blend of classical architecture elements and modern skyscrapers is illuminated with bright, futuristic lighting. The background is filled with sleek, ultra-modern buildings against a deep blue to purple sky gradient. In the foreground, one side showcases an ancient architectural structure like a roman column or a gothic archway subtly blending with the skyline. On the opposite side, there is a visual representation of software architecture diagrams in the form of interconnected nodes and lines, merging seamlessly with the physical buildings. Logos for relevant technologies such as Linux, BSD, Unix-like OS, Docker, and Kubernetes subtly integrated on the structures, connected by digital lines. The image is further embellished with visual effects like light trails, glowing edges, digital patterns, reflective and transparent elements, all within a cohesive color palette of blues, purples, and silvers. This design symbolizes the fusion of traditional building architecture and modern software architecture, merging the world of physical structure with digital innovation."
    }
}
