{
    "meetingDate": "2021-10-13",
    "meetingType": "SLUUG",
    "presentations": [
        {
            "title": "gitso for remote support",
            "presenterNames": ["Stan Reichardt"],
            "abstract": "Gitso is to support others.\nA simple frontend for reverse VNC connections (remote assistance). Gitso is a cross-platform (Linux, OS X and Windows) graphical program to easily connect one person to another person's screen, keyboard and mouse. This makes it straight-forward to get help or give technical support.\nIn a simple two-step process, the person giving support first sets up port forwarding and firewalling on his end, if necessary, and starts Gitso to listen for incoming connections on port 5500. Then, the person looking for help uses Gitso to connect to the supporter's address (IP or domain name), making their screen remotely visible and allowing the supporter to use their keyboard and mouse.",
            "references": [
                {
                    "linkText": "gitso",
                    "url": "https://github.com/AustP/Gitso"
                }
            ],
            "tags": ["remote-access", "networking"],
            "tweet": "Don't miss Stan Reichardt's presentation on 'gitso for remote support'! Learn how to give or receive technical support through Gitso's simple two-step process. October 13! 🛠️📅 #SLUUG #Gitso #TechHelp https://www.meetup.com/saint-louis-unix-users-group/events/280817084/"
        },
        {
            "title": "Snap Your Way Out of Dependency Hell",
            "presenterNames": ["Lee Lammert"],
            "abstract": "Snaps are self-contained applications running in a sandbox with mediated access to the host system. Snap was originally released for cloud applications but was later ported to work for Internet of Things devices and desktop applications too. (from Wikipidia).",
            "references": [
                {
                    "linkText": "snapcraft",
                    "url": "https://snapcraft.io/"
                }
            ],
            "tags": ["application-packaging", "snaps"],
            "tweet": "Mark your calendars for 2021-10-13! Lee Lammert will dive deep into snaps, helping you avoid dependency hell once and for all. Don't miss out! #Unix #OpenSource https://www.meetup.com/saint-louis-unix-users-group/events/280817084/"
        }
    ],
    "meetupUrl": "https://www.meetup.com/saint-louis-unix-users-group/events/280817084/",
    "youtubeUrl": "https://www.youtube.com/watch?v=OX4UjTjPKDs",
    "youtubeTitle": "Effortless Remote Support with Gitso: Tutorial and Setup | SLUUG 2021-10-13",
    "image": {
        "src": "./2021-10-13_sluug_create-a-technologically-detailed-image-that-reflects-the-es.png",
        "alt": "Create a technologically detailed image that reflects the essence of remote support, connectivity and collaboration. Start with a sleek, dark-to-light gradient background transitioning from navy at the top to vibrant blue at the bottom. In the center, display a glowing hologram of a tilted computer screen showing a stylized desktop interface. From the hologram, have subtle neon blue glowing lines radiating out towards various nodes symbolizing interconnected devices. Below the hologram, integrate semi-transparent holographic representations of a keyboard and mouse. Subtly incorporate logos of Gitso, VNC, and screen sharing into the connection lines, all semi-transparent with neon accents. Enhance the high-tech atmosphere with soft, diffused light effects around the hologram and logos, possibly with light particles or small data streams flowing within the lines. The image composition should be balanced, with a cool color palette of blues, purples, and occasional neon accents in greens or yellows."
    }
}
