{
    "meetingDate": "2021-05-20",
    "meetingType": "STLLUG",
    "presentations": [
        {
            "title": "How I learned to use Syncthing when Plex decided to stop doing its job.",
            "presenterNames": ["Tyler Rudie"],
            "abstract": "It is a tale as old as computers. A Computer Wizard comes along and shows how they can make your life easier and all you have to do is pay them. Then a few years later, ok 6 years later, they up and say that some other Balrog is a better use of their time. This is how I replaced the Camera Upload function in Plex with the Syncthing Process.",
            "references": [
                {
                    "linkText": "Syncthing",
                    "url": "https://syncthing.net/"
                }
            ],
            "tags": ["syncthing", "plex"],
            "tweet": "Curious about improving your media management? Tyler Rudie will share his insights on replacing Plex with Syncthing on 2021-05-20. Make sure to tune in! #TechTalk #OpenSource #SLUUG https://www.meetup.com/saint-louis-unix-users-group/events/276369887/"
        }
    ],
    "meetupUrl": "https://www.meetup.com/saint-louis-unix-users-group/events/276369887/",
    "youtubeUrl": "https://www.youtube.com/watch?v=VDKW3QDXny8",
    "youTubeTitle": "Switching from Plex to Syncthing: My Journey to Better Photo Management | STLLUG 2021-05-20",
    "image": {
        "src": "./2021-05-20_stllug_create-a-futuristic-cityscape-with-a-sleek-dark-design-the.png",
        "alt": "Create a futuristic cityscape with a sleek, dark design. The left side of the image is stormy with a prominent, yet faded and weathered Plex logo indicating frustration and disappointment. Lightning shall punctuate the turmoil. This contrast with the image's right side, showcasing a clear sky with rays of sunshine, and the crisp, bright Syncthing logo, signifying reliability and success. A glowing path cuts through the image, leading from the stormy side to the clear side, symbolizing the transition from Plex to Syncthing. Binary code or data streams flow from the Plex logo towards the Syncthing logo, representing the migration of functionality. Holographic icons for data transfer and synchronization are present between the two logos, adding a 3D element. Use dark tones like various shades of blues and blacks for the stormy side and silvers, whites, and light blue for the bright one."
    }
}
