{
    "meetingDate": "2021-11-18",
    "meetingType": "STLLUG",
    "presentations": [
        {
            "title": "The Internet Archive celebrated its 25th Anniversary",
            "presenterNames": ["Scott Granneman"],
            "abstract": "The Internet Archive is one of the best things about the Web, and it deserves a careful examination and appreciation. This talk will look at the history, purpose, and amazingly complete features of the Internet Archive. I promise you will learn a lot of cool new things about the Internet Archive that you can immediately!\nThe Internet Archive celebrated its 25th Anniversary 1 month ago on Oct 21.\nSo, Scott Granneman of https://www.websanity.com/ will take us down memory lane.\nScott has pulled various gems from the Archieve for classes he's taught at Wash U & Webster U. Scott will give us a flavor of what goodies are available.\nThe Internet Archive is a non-profit digital library in the heart of San Francisco, CA.\nIt convenes the Decentralized Web Summit (https://decentralizedweb.net/) and other events.\n================================\nWhat's in The Archive...\nOfficial Internet Archive Statistics for 2020\nGENERAL\n• 70+ unique petabytes of data (that’s 70,000,000 gigabytes!)\n• 65+ million public media items (texts, movies, audio, images, etc.)\n• 1.5 million unique web site users per day\n• 17,000 uploads from users per day\n\nWAYBACK MACHINE\n• 588 billion web pages\n• 750 million pages captured per day\n• 550,000 users per day\n\nARCHIVE-IT\n• 49 billion curated URLs captured in 14,000 collections\n• 800+ partner organizations creating collections\n\nBOOKS\n• 28 million texts in the collections (books, documents, magazines, etc.)\n• 4.6 million books digitized by Internet Archive\n• 3,500 books digitized per day in 18 digitization centers worldwide\n\nTELEVISION\n• 2 million news programs available for closed caption search\n• 3,000 broadcast hours from the events of 9/11/01\n\nMOVIES\n• 4 million movie items (not including television programs)\n\nAUDIO\n• 14 million audio items, including\n• 220,000 live music concerts from 8,000 bands\n• 200,000 78rpm sides digitized\n\nSOFTWARE\n• 580,000 software titles, many emulatable through a web browser\n\nIMAGES\n• 3.5 million images",
            "tags": ["web"],
            "tweet": "Save the date! Nov 18, Scott Granneman explores the Internet Archive's rich history and features at our next SLUUG meet. Discover new cool facts and hidden gems from the world's digital library. #TechTalk #InternetArchive #SLUUG @SLUUG_Org https://www.meetup.com/saint-louis-unix-users-group/events/280493550/"
        }
    ],
    "meetupUrl": "https://www.meetup.com/saint-louis-unix-users-group/events/280493550/",
    "youtubeUrl": "https://www.youtube.com/watch?v=_minw54SR9c",
    "youtubeTitle": "Celebrating the Internet Archive: 25 Years of Digital Preservation and Innovation |STLLUG 2021-11-18",
    "image": {
        "src": "./2021-11-18_stllug_create-a-futuristic-image-representing-the-internet-archive.png",
        "alt": "Create a futuristic image representing the Internet Archive using a dark color palette with deep blues and blacks, highlighted with neon colors. The background should feature a digital tunnel made of web pages and books, giving an impression of journeying through a historical archive, surrounded by fluffy, holographic effects. Prominently displayed in the center, incorporate the Internet Archive logo. Smaller Decentralized Web logos should flow through the tunnel subtly. Visualize a time-lapse of past and present web pages cycling around the main logo, juxtaposed with floating 3D digital bookshelves to represent diverse collections. Include abstract audio waves and film reels to signify multimedia content, with a Matrix-like effect of binary code in the background. Add depth with light shafts and holographic data interfaces, while network nodes and web-like connections should hint at various networks and decentralized web initiatives. The image should be high resolution with clear contrast, and without text, embodying the broad and diverse impact of the Internet Archive over the years."
    }
}
