{
    "meetingDate": "2021-10-21",
    "meetingType": "STLLUG",
    "presentations": [
        {
            "title": "Open Discussion",
            "presenterNames": ["Roundtable Discusion"],
            "abstract": "The meeting starts with an announcement that there is no presentation due to miscommunication.  People are invited to ask questions and share comments. One attendee is having trouble figuring out why his laptop is showing multiple IP addresses and asks for help from the group. The conversation goes into a technical discussion about IP addresses, routers, and MAC addresses. Another attendee mentions upcoming security videos being offered by ITPro.tv.",
            "tags": ["networking"],
            "tweet": "Excited for our Open Discussion on 2021-10-21! No set presentations, just pure tech brainstorming. Get insights on networking and security directly from peers! #OpenSource #TechCommunity"
        }
    ],
    "youtubeUrl": "https://www.youtube.com/watch?v=5XtlZOy0n28",
    "youtubeTitle": "Open Discussion: Troubleshooting & Bantar | STLLUG 2021-10-21",
    "image": {
        "src": "./2021-10-21_stllug_create-an-image-filled-with-futuristic-space-like-matrix-ae.png",
        "alt": "Create an image filled with futuristic, space-like matrix aesthetics. The background should be dark, dotted with interconnected nodes and lines representing network connections and data flow in shades of blue, green, and white for a high-tech feel. In the forefront, feature a slightly translucent laptop with an open screen displaying a complex network topology diagram. Subtly integrate logos such as IP, routers, and MAC into the network matrix with a slight glow to draw attention. Also, depict small floating holograms of networking gear, IP/MAC address icons, and security icons around the laptop. Include faint figures sitting around a virtual roundtable made from lines and nodes, indicating an open discussion among diverse individuals. The style should be modern and clean with sleek graphics and subtle gradients to give depth. Add a soft, neon-like glow around the laptop screen and logos and lightly textured digital patterns in the background for added visual interest."
    }
}
