{
    "meetingDate": "2022-01-20",
    "meetingType": "STLLUG",
    "presentations": [
        {
            "title": "RIP CentOS… Now what?",
            "presenterNames": ["David Gilpin"],
            "abstract": "On 12/31/2021 IBM/Red Hat end-of-lifed CentOS 8. CentOS has historically been a downstream rebuild of Red Hat Enterprise Linux. CentOS Stream 8 is designated an upstream (development) branch of Red Hat Enterprise Linux - a continual Beta release.\nOracle Linux has been a tracking release of RHEL since 2006. This presentation will review the Oracle Linux operating environment and how it is a great CentOS alternative. We will also cover Oracle’s involvement and commitment to Open Source software.",
            "tags": ["redhat", "centos", "oracle-linux", "virtualization"],
            "tweet": "Mark your calendars for January 20th! David Gilpin will guide us through the CentOS end-of-life transition and show us why Oracle Linux is a strong alternative. #FOSS #RHEL #LinuxCommunity https://www.meetup.com/saint-louis-unix-users-group/events/280493567/"
        }
    ],
    "meetupUrl": "https://www.meetup.com/saint-louis-unix-users-group/events/280493567/",
    "youtubeTitle": "RIP CentOS: Exploring Oracle Linux as a Reliable Alternative | STLLUG 2022-01-20",
    "image": {
        "src": "./2022-01-20_stllug_design-an-image-capturing-a-transition-from-one-operating-sy.png",
        "alt": "Design an image capturing a transition from one operating system to another. The background should start with a deep red gradient on the left, transitioning to dark blue on the right. On the left, place a logo representing an antiquated operating system, slightly faded to symbolize its status. An arrow or curved pathway should link this logo to a brighter, more vibrant logo on the right, representing a modern operating system. Subtle gear icons and code snippets should dimish in size as they move along this pathway. The center of the image should have an open-source symbol, subtly positioned against the background gradient. On the right side of the image, integrate cloud or server symbols close to the modern operating system logo."
    }
}
